W4D5/music_app/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "band_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Baked"], ["year", 2018], ["band_id", 1]]
---
  def create
    @album = Album.new(album_params)

    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1 WHERE "albums"."id" = $2  [["year", 2019], ["id", 4]]
---
  def update
    @album = Album.find(params[:id])

    if @album.update(album_params)