W4D5/music_app/app/controllers/tracks_controller.rb

  def create
    @track = Track.new(track_params)

    if @track.save
---
INSERT INTO "tracks" ("title", "album_id", "ord", "lyrics") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Lit"], ["album_id", 5], ["ord", 1], ["lyrics", "Hahaha."]]

  def update
    @track = Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]