W4D5/music_app/app/views/tracks/_form.html.erb

SELECT "albums".* FROM "albums"
---
  <select id='track-album' name="track[album_id]">
    <% Album.all.each do |album| %>