W4D5/music_app/app/views/albums/show.html.erb


<% if @album.tracks.length > 0 %>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 5]]